In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.Series(np.random.rand(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [5]:
data

a  1    0.423963
   2    0.904148
   3    0.113451
b  1    0.147977
   3    0.711438
c  1    0.232002
   2    0.927627
d  2    0.770625
   3    0.779630
dtype: float64

In [6]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [11]:
data['b':'c']

b  1    0.147977
   3    0.711438
c  1    0.232002
   2    0.927627
dtype: float64

In [12]:
data.loc['b':'c']

b  1    0.147977
   3    0.711438
c  1    0.232002
   2    0.927627
dtype: float64

In [14]:
data.loc[:,2]

a    0.904148
c    0.927627
d    0.770625
dtype: float64

In [16]:
data.unstack().stack()

a  1    0.423963
   2    0.904148
   3    0.113451
b  1    0.147977
   3    0.711438
c  1    0.232002
   2    0.927627
d  2    0.770625
   3    0.779630
dtype: float64

In [17]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
   ....:                      index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
   ....:                      columns=[['Ohio', 'Ohio', 'Colorado'],
   ....:                               ['Green', 'Red', 'Green']])

In [18]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [58]:
frame.loc['a',['Ohio','Green']]

state  Ohio
color Green Red
Key2
1         0   1
2         3   4

In [55]:
frame.index.names=['Key1','Key2']

In [56]:
frame.columns.names = ['state', 'color']

In [60]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [61]:
frame

state      Ohio     Colorado
color     Green Red    Green
Key1 Key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [67]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
Key1 Key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [71]:
frame.swaplevel(0,1).sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
Key2 Key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [76]:
frame.swaplevel('state','color',axis=1)

color     Green  Red    Green
state      Ohio Ohio Colorado
Key1 Key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [80]:
frame.sum(level=1,axis=1)

color      Green  Red
Key1 Key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [81]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
   ....:                       'c': ['one', 'one', 'one', 'two', 'two',
   ....:                             'two', 'two'],
   ....:                       'd': [0, 1, 2, 0, 1, 2, 3]})

In [82]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [88]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3